[
  {
    "Rank": 1,
    "MovieTitle": "His House",
    "Year": 2020,
    "Score": 100,
    "Director": "Remi Weekes",
    "Cast": "Wunmi Mosaku, Sope Dirisu, Matt Smith, Cornell John",
    "CriticsConsensus": "Featuring genuine scares through every corridor, His House is a terrifying look at the specters of the refugee experience and a stunning feature debut for Remi Weekes."
  },
  {
    "Rank": 2,
    "MovieTitle": "How to Train Your Dragon",
    "Year": 2010,
    "Score": 99,
    "Director": "Christopher Sanders",
    "Cast": "Jay Baruchel, Gerard Butler, America Ferrera, Jonah Hill",
    "CriticsConsensus": "Boasting dazzling animation, a script with surprising dramatic depth, and thrilling 3-D sequences, How to Train Your Dragon soars."
  },
  {
    "Rank": 3,
    "MovieTitle": "The Forty-Year-Old Version",
    "Year": 2020,
    "Score": 99,
    "Director": "Radha Blank",
    "Cast": "Welker White, Reed Birney, Radha Blank, Peter Kim",
    "CriticsConsensus": "The Forty-Year-Old Version opens a compelling window into the ebbs and flows of the artist's life -- and announces writer-director-star Radha Blank as a major filmmaking talent with her feature debut."
  },
  {
    "Rank": 4,
    "MovieTitle": "Under the Shadow",
    "Year": 2016,
    "Score": 99,
    "Director": "Babak Anvari",
    "Cast": "Narges Rashidi, Avin Manshadi, Bobby Naderi, Ray Haratian",
    "CriticsConsensus": "Under the Shadow deftly blends seemingly disparate genres to deliver an effective chiller with timely themes and thought-provoking social subtext."
  },
  {
    "Rank": 5,
    "MovieTitle": "Monty Python and the Holy Grail",
    "Year": 1975,
    "Score": 98,
    "Director": "Terry Gilliam",
    "Cast": "Graham Chapman, John Cleese, Terry Gilliam, Eric Idle",
    "CriticsConsensus": "A cult classic as gut-bustingly hilarious as it is blithely ridiculous, Monty Python and the Holy Grail has lost none of its exceedingly silly charm."
  },
  {
    "Rank": 6,
    "MovieTitle": "Ma Rainey's Black Bottom",
    "Year": 2020,
    "Score": 97,
    "Director": "George C. Wolfe",
    "Cast": "Viola Davis, Chadwick Boseman, Glynn Turman, Colman Domingo",
    "CriticsConsensus": "Framed by a pair of powerhouse performances, Ma Rainey's Black Bottom pays affectionate tribute to a blues legend -- and Black culture at large."
  },
  {
    "Rank": 7,
    "MovieTitle": "The Hurt Locker",
    "Year": 2008,
    "Score": 97,
    "Director": "Kathryn Bigelow",
    "Cast": "Jeremy Renner, Anthony Mackie, Brian Geraghty, Guy Pearce",
    "CriticsConsensus": "A well-acted, intensely shot, action filled war epic, Kathryn Bigelow's The Hurt Locker is thus far the best of the recent dramatizations of the Iraq War."
  },
  {
    "Rank": 8,
    "MovieTitle": "Hell or High Water",
    "Year": 2016,
    "Score": 97,
    "Director": "David Mackenzie",
    "Cast": "Jeff Bridges, Chris Pine, Ben Foster, Gil Birmingham",
    "CriticsConsensus": "Hell or High Water offers a solidly crafted, well-acted Western heist thriller that eschews mindless gunplay in favor of confident pacing and full-bodied characters."
  },
  {
    "Rank": 9,
    "MovieTitle": "Won't You Be My Neighbor?",
    "Year": 2018,
    "Score": 97,
    "Director": "Morgan Neville",
    "Cast": "Joanne Rogers, Bill Isler, Hedda Sharapan, Margaret Whitmer",
    "CriticsConsensus": "Won't You Be My Neighbor? takes a fittingly patient and honest look at the life and legacy of a television pioneer whose work has enriched generations."
  },
  {
    "Rank": 10,
    "MovieTitle": "Dolemite Is My Name",
    "Year": 2019,
    "Score": 97,
    "Director": "Craig Brewer",
    "Cast": "Eddie Murphy, Wesley Snipes, Kodi Smit-McPhee, Keegan-Michael Key",
    "CriticsConsensus": "In dramatizing Rudy Ray Moore's stranger-than-fiction story, Eddie Murphy makes Dolemite Is My Name just as bold, brash, and ultimately hard to resist as its subject."
  },
  {
    "Rank": 11,
    "MovieTitle": "Hunt for the Wilderpeople",
    "Year": 2016,
    "Score": 97,
    "Director": "Taika Waititi",
    "Cast": "Sam Neill, Julian Dennison, Rima Te Wiata, Rachel House",
    "CriticsConsensus": "The charmingly offbeat Hunt for the Wilderpeople unites a solid cast, a talented filmmaker, and a poignant, funny, deeply affecting message."
  },
  {
    "Rank": 12,
    "MovieTitle": "Mudbound",
    "Year": 2017,
    "Score": 97,
    "Director": "Dee Rees",
    "Cast": "Carey Mulligan, Jason Clarke, Jason Mitchell, Mary J. Blige",
    "CriticsConsensus": "Mudbound offers a well-acted, finely detailed snapshot of American history whose scenes of rural class struggle resonate far beyond their period setting."
  },
  {
    "Rank": 13,
    "MovieTitle": "I Lost My Body",
    "Year": 2019,
    "Score": 97,
    "Director": "Jérémy Clapin",
    "Cast": "Hakim Faris, Victoire Du Bois, Patrick d'Assumçao, Belek Abdelmalek",
    "CriticsConsensus": "Beautifully animated and utterly unique, I Lost My Body takes audiences on a singularly strange journey whose unexpected contours lead to a wholly satisfying destination."
  },
  {
    "Rank": 14,
    "MovieTitle": "Rocks",
    "Year": 2019,
    "Score": 97,
    "Director": "Sarah Gavron",
    "Cast": "Bukky Bakray, Ruby Stokes, Sarah Niles, Layo-Christina Akinlude",
    "CriticsConsensus": "A fresh, funny coming-of-age story rooted in realistic characters and anchored with a meaningful message, Rocks is as solid as its title suggests."
  },
  {
    "Rank": 15,
    "MovieTitle": "Roma",
    "Year": 2018,
    "Score": 96,
    "Director": "Alfonso Cuarón",
    "Cast": "Yalitza Aparicio, Marina de Tavira, Marco Graf, Fernando Grediaga",
    "CriticsConsensus": "Roma finds writer-director Alfonso Cuarón in complete, enthralling command of his visual craft - and telling the most powerfully personal story of his career."
  },
  {
    "Rank": 16,
    "MovieTitle": "Atlantics",
    "Year": 2019,
    "Score": 96,
    "Director": "Mati Diop",
    "Cast": "Abdou Balde, Aminata Kane, Ibrahima Mbaye, Amadou Mbow",
    "CriticsConsensus": "An unpredictable supernatural drama rooted in real-world social commentary, Atlantique suggests a thrillingly bright future for debuting filmmaker Mati Diop."
  },
  {
    "Rank": 17,
    "MovieTitle": "Psycho",
    "Year": 1960,
    "Score": 96,
    "Director": "Alfred Hitchcock",
    "Cast": "Anthony Perkins, Janet Leigh, Vera Miles, John Gavin",
    "CriticsConsensus": "Infamous for its shower scene, but immortal for its contribution to the horror genre. Because Psycho was filmed with tact, grace, and art, Hitchcock didn't just create modern horror, he validated it."
  },
  {
    "Rank": 18,
    "MovieTitle": "To All the Boys I've Loved Before",
    "Year": 2018,
    "Score": 96,
    "Director": "Susan Johnson",
    "Cast": "Lana Condor, John Corbett, Noah Centineo, Emilija Baranac",
    "CriticsConsensus": "To All the Boys I've Loved Before plays by the teen rom-com rules, but relatable characters and a thoroughly charming cast more than make up for a lack of surprises."
  },
  {
    "Rank": 19,
    "MovieTitle": "Life of Brian",
    "Year": 1979,
    "Score": 96,
    "Director": "Terry Jones",
    "Cast": "Graham Chapman, John Cleese, Terry Gilliam, Terry Jones",
    "CriticsConsensus": "One of the more cutting-edge films of the 1970s, this religious farce from the classic comedy troupe is as poignant as it is funny and satirical."
  },
  {
    "Rank": 20,
    "MovieTitle": "Outside In",
    "Year": 2017,
    "Score": 96,
    "Director": "Lynn Shelton",
    "Cast": "Jay Duplass, Edie Falco, Kaitlyn Dever, Ben Schwartz",
    "CriticsConsensus": "Brilliantly brought to life by tenderly empathetic performances from Jay Duplass and Edie Falco, Outside In tells a sobering -- yet thoroughly absorbing -- story."
  },
  {
    "Rank": 21,
    "MovieTitle": "The Irishman",
    "Year": 2019,
    "Score": 95,
    "Director": "Martin Scorsese",
    "Cast": "Robert De Niro, Al Pacino, Joe Pesci, Anna Paquin",
    "CriticsConsensus": "An epic gangster drama that earns its extended runtime, The Irishman finds Martin Scorsese revisiting familiar themes to poignant, funny, and profound effect."
  },
  {
    "Rank": 22,
    "MovieTitle": "Marriage Story",
    "Year": 2019,
    "Score": 95,
    "Director": "Noah Baumbach",
    "Cast": "Scarlett Johansson, Adam Driver, Azhy Robertson, Laura Dern",
    "CriticsConsensus": "Observing a splintering union with compassion and expansive grace, the powerfully acted Marriage Story ranks among writer-director Noah Baumbach's best works."
  },
  {
    "Rank": 23,
    "MovieTitle": "It Follows",
    "Year": 2014,
    "Score": 95,
    "Director": "David Robert Mitchell",
    "Cast": "Maika Monroe, Keir Gilchrist, Daniel Zovatto, Jake Weary",
    "CriticsConsensus": "Smart, original, and above all terrifying, It Follows is the rare modern horror film that works on multiple levels -- and leaves a lingering sting."
  },
  {
    "Rank": 24,
    "MovieTitle": "The Lord of the Rings: The Two Towers",
    "Year": 2002,
    "Score": 95,
    "Director": "Peter Jackson",
    "Cast": "Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen",
    "CriticsConsensus": "The Two Towers balances spectacular action with emotional storytelling, leaving audiences both wholly satisfied and eager for the final chapter."
  },
  {
    "Rank": 25,
    "MovieTitle": "Klaus",
    "Year": 2019,
    "Score": 95,
    "Director": "Sergio Pablos",
    "Cast": "Jason Schwartzman, J.K. Simmons, Rashida Jones, Will Sasso",
    "CriticsConsensus": "Beautiful hand-drawn animation and a humorous, heartwarming narrative make Klaus an instant candidate for holiday classic status."
  },
  {
    "Rank": 26,
    "MovieTitle": "Croupier",
    "Year": 1998,
    "Score": 95,
    "Director": "Mike Hodges",
    "Cast": "Clive Owen, Kate Hardie, Alex Kingston, Gina McKee",
    "CriticsConsensus": "The writer slumming for human truths and real experience is a common enough story, but this cool-headed and slick thriller provides a gut-churningly compelling backdrop to a look at our darker sides."
  },
  {
    "Rank": 27,
    "MovieTitle": "Call Me by Your Name",
    "Year": 2017,
    "Score": 94,
    "Director": "Luca Guadagnino",
    "Cast": "Armie Hammer, Timothée Chalamet, Michael Stuhlbarg, Amira Casar",
    "CriticsConsensus": "Call Me by Your Name offers a melancholy, powerfully affecting portrait of first love, empathetically acted by Timothée Chalamet and Armie Hammer."
  },
  {
    "Rank": 28,
    "MovieTitle": "The Power of the Dog",
    "Year": 2021,
    "Score": 94,
    "Director": "Jane Campion",
    "Cast": "Benedict Cumberbatch, Kirsten Dunst, Jesse Plemons, Kodi Smit-McPhee",
    "CriticsConsensus": "Brought to life by a stellar ensemble led by Benedict Cumberbatch, The Power of the Dog reaffirms writer-director Jane Campion as one of her generation's finest filmmakers."
  },
  {
    "Rank": 29,
    "MovieTitle": "Carol",
    "Year": 2015,
    "Score": 94,
    "Director": "Todd Haynes",
    "Cast": "Cate Blanchett, Rooney Mara, Sarah Paulson, Jake Lacy",
    "CriticsConsensus": "Shaped by Todd Haynes' deft direction and powered by a strong cast led by Cate Blanchett and Rooney Mara, Carol lives up to its groundbreaking source material."
  },
  {
    "Rank": 30,
    "MovieTitle": "Moneyball",
    "Year": 2011,
    "Score": 94,
    "Director": "Bennett Miller",
    "Cast": "Brad Pitt, Jonah Hill, Philip Seymour Hoffman, Robin Wright",
    "CriticsConsensus": "Director Bennett Miller, along with Brad Pitt and Jonah Hill, take a niche subject and turn it into a sharp, funny, and touching portrait worthy of baseball lore."
  },
  {
    "Rank": 31,
    "MovieTitle": "The Lost Daughter",
    "Year": 2021,
    "Score": 94,
    "Director": "Maggie Gyllenhaal",
    "Cast": "Olivia Colman, Dakota Johnson, Peter Sarsgaard, Jessie Buckley",
    "CriticsConsensus": "A strikingly assured debut for writer-director Maggie Gyllenhaal, The Lost Daughter unites a brilliant cast in service of a daringly ambitious story."
  },
  {
    "Rank": 32,
    "MovieTitle": "The Sea Beast",
    "Year": 2022,
    "Score": 94,
    "Director": "Chris Williams",
    "Cast": "Karl Urban, Zaris-Angel Hator, Jared Harris, Dan Stevens",
    "CriticsConsensus": "An original animated tale that's often as daring as its characters, The Sea Beast sends audiences on a voyage well worth taking."
  },
  {
    "Rank": 33,
    "MovieTitle": "Private Life",
    "Year": 2018,
    "Score": 94,
    "Director": "Tamara Jenkins",
    "Cast": "Paul Giamatti, Kathryn Hahn, Kayli Carter, Molly Shannon",
    "CriticsConsensus": "Private Life uses one couple's bumpy journey to take an affecting look at an easily identifiable - and too rarely dramatized - rite of adult passage."
  },
  {
    "Rank": 34,
    "MovieTitle": "Enola Holmes 2",
    "Year": 2022,
    "Score": 94,
    "Director": "Harry Bradbeer",
    "Cast": "Millie Bobby Brown, Henry Cavill, Helena Bonham Carter, David Thewlis",
    "CriticsConsensus": "Building on its predecessor with boisterously entertaining flair, Enola Holmes 2 solves the mystery of how to make a satisfying sequel -- and makes it look positively elementary."
  },
  {
    "Rank": 35,
    "MovieTitle": "The Birds",
    "Year": 1963,
    "Score": 94,
    "Director": "Alfred Hitchcock",
    "Cast": "Rod Taylor, Tippi Hedren, Suzanne Pleshette, Jessica Tandy",
    "CriticsConsensus": "Proving once again that build-up is the key to suspense, Alfred Hitchcock successfully turned birds into some of the most terrifying villains in horror history."
  },
  {
    "Rank": 36,
    "MovieTitle": "Captain Phillips",
    "Year": 2013,
    "Score": 93,
    "Director": "Paul Greengrass",
    "Cast": "Tom Hanks, Catherine Keener, Barkhad Abdi, Barkhad Abdirahman",
    "CriticsConsensus": "Smart, powerfully acted, and incredibly intense, Captain Phillips offers filmgoers a Hollywood biopic done right -- and offers Tom Hanks a showcase for yet another brilliant performance."
  },
  {
    "Rank": 37,
    "MovieTitle": "Spider-Man 2",
    "Year": 2004,
    "Score": 93,
    "Director": "Sam Raimi",
    "Cast": "Tobey Maguire, Kirsten Dunst, James Franco, Alfred Molina",
    "CriticsConsensus": "Boasting an entertaining villain and deeper emotional focus, this is a nimble sequel that improves upon the original."
  },
  {
    "Rank": 38,
    "MovieTitle": "The Lord of the Rings: The Return of the King",
    "Year": 2003,
    "Score": 93,
    "Director": "Peter Jackson",
    "Cast": "Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen",
    "CriticsConsensus": "Visually breathtaking and emotionally powerful,  The Lord of the Rings - The Return of the King is a moving and satisfying conclusion to a great trilogy."
  },
  {
    "Rank": 39,
    "MovieTitle": "The Meyerowitz Stories (New and Selected)",
    "Year": 2017,
    "Score": 93,
    "Director": "Noah Baumbach",
    "Cast": "Adam Sandler, Ben Stiller, Dustin Hoffman, Emma Thompson",
    "CriticsConsensus": "The Meyerowitz Stories (New and Selected) observes the family dynamic through writer-director Noah Baumbach's bittersweet lens and the impressive efforts of a remarkable cast."
  },
  {
    "Rank": 40,
    "MovieTitle": "Hustle",
    "Year": 2022,
    "Score": 93,
    "Director": "Jeremiah Zagar",
    "Cast": "Adam Sandler, Juancho Hernangomez, Queen Latifah, Ben Foster",
    "CriticsConsensus": "Hustle doesn't have any fancy moves, but it doesn't need them -- Adam Sandler's everyman charm makes this easy layup fun to watch."
  },
  {
    "Rank": 41,
    "MovieTitle": "Cam",
    "Year": 2018,
    "Score": 93,
    "Director": "Daniel Goldhaber",
    "Cast": "Madeline Brewer, Patch Darragh, Melora Walters, Devin Druid",
    "CriticsConsensus": "Smart and suspenseful, CAM is a techno-thriller that's far more than the sum of its salacious parts -- and an outstanding showcase for Madeline Brewer in the leading role."
  },
  {
    "Rank": 42,
    "MovieTitle": "Hush",
    "Year": 2016,
    "Score": 93,
    "Director": "Mike Flanagan",
    "Cast": "John Gallagher Jr., Kate Siegel, Michael Trucco, Samantha Sloyan",
    "CriticsConsensus": "Hush navigates the bloody waters of home invasion thrillers and incisive slashers for a contemporary horror puree."
  },
  {
    "Rank": 43,
    "MovieTitle": "Sand Storm",
    "Year": 2016,
    "Score": 93,
    "Director": "Elite Zexer",
    "Cast": "Lamis Ammar, Ruba Blal, Hitham Omari, Khadija Al Akel",
    "CriticsConsensus": "Sand Storm marks an impressive first feature for debuting writer-director Elite Zexer that offers a perceptive -- and crucial -- look at patriarchal traditions."
  },
  {
    "Rank": 44,
    "MovieTitle": "Glass Onion: A Knives Out Mystery",
    "Year": 2022,
    "Score": 92,
    "Director": "Rian Johnson",
    "Cast": "Daniel Craig, Ed Norton, Dave Bautista, Kate Hudson",
    "CriticsConsensus": "Glass Onion: A Knives Out Mystery brings back Benoit Blanc for another wildly entertaining mystery rounded out by an outstanding ensemble cast."
  },
  {
    "Rank": 45,
    "MovieTitle": "Skyfall",
    "Year": 2012,
    "Score": 92,
    "Director": "Sam Mendes",
    "Cast": "Daniel Craig, Judi Dench, Javier Bardem, Ralph Fiennes",
    "CriticsConsensus": "Sam Mendes brings Bond surging back with a smart, sexy, riveting action thriller that qualifies as one of the best 007 films to date."
  },
  {
    "Rank": 46,
    "MovieTitle": "Da 5 Bloods",
    "Year": 2020,
    "Score": 92,
    "Director": "Spike Lee",
    "Cast": "Delroy Lindo, Jonathan Majors, Clarke Peters, Norm Lewis",
    "CriticsConsensus": "Fierce energy and ambition course through Da 5 Bloods, coming together to fuel one of Spike Lee's most urgent and impactful films."
  },
  {
    "Rank": 47,
    "MovieTitle": "American Hustle",
    "Year": 2013,
    "Score": 92,
    "Director": "David O. Russell",
    "Cast": "Christian Bale, Bradley Cooper, Jeremy Renner, Amy Adams",
    "CriticsConsensus": "Riotously funny and impeccably cast, American Hustle compensates for its flaws with unbridled energy and some of David O. Russell's most irrepressibly vibrant direction."
  },
  {
    "Rank": 48,
    "MovieTitle": "The Bourne Ultimatum",
    "Year": 2007,
    "Score": 92,
    "Director": "Paul Greengrass",
    "Cast": "Matt Damon, Julia Stiles, Joan Allen, David Strathairn",
    "CriticsConsensus": "The Bourne Ultimatum is an intelligent, finely tuned non-stop thrill ride. Another strong performance from Matt Damon and sharp camerawork from Paul Greengrass make this the finest installment of the Bourne trilogy."
  },
  {
    "Rank": 49,
    "MovieTitle": "El Camino: A Breaking Bad Movie",
    "Year": 2019,
    "Score": 92,
    "Director": "Vince Gilligan",
    "Cast": "Aaron Paul, Matt L. Jones, Charles Baker",
    "CriticsConsensus": "Entertaining if not essential, El Camino adds a satisfying belated coda to the Breaking Bad story -- led by a career-best performance from Aaron Paul."
  },
  {
    "Rank": 50,
    "MovieTitle": "We the Animals",
    "Year": 2018,
    "Score": 92,
    "Director": "Jeremiah Zagar",
    "Cast": "Raúl Castillo, Sheila Vand, Evan Rosado, Isaiah Kristian",
    "CriticsConsensus": "Dreamlike and haunting, We the Animals approaches the coming-of-age odyssey with a uniquely documentarian eye."
  },
  {
    "Rank": 51,
    "MovieTitle": "The Little Prince",
    "Year": 2015,
    "Score": 92,
    "Director": "Mark Osborne",
    "Cast": "Jeff Bridges, Rachel McAdams, James Franco, Marion Cotillard",
    "CriticsConsensus": "Beautifully animated and faithful to the spirit of its classic source material, The Little Prince is a family-friendly treat that anchors thrilling visuals with a satisfying story."
  },
  {
    "Rank": 52,
    "MovieTitle": "Roald Dahl's Matilda the Musical",
    "Year": 2022,
    "Score": 92,
    "Director": "Matthew Warchus",
    "Cast": "Alisha Weir, Emma Thompson, Lashana Lynch, Stephen Graham",
    "CriticsConsensus": "Roald Dahl's Matilda the Musical brings the classic story back to the screen with a delightful Emma Thompson, dazzling dancing, and a suitably irascible take on the source material."
  },
  {
    "Rank": 53,
    "MovieTitle": "Rocky",
    "Year": 1976,
    "Score": 92,
    "Director": "John G. Avildsen",
    "Cast": "Sylvester Stallone, Talia Shire, Burgess Meredith, Burt Young",
    "CriticsConsensus": "This story of a down-on-his-luck boxer is thoroughly predictable, but Sylvester Stallone's script and stunning performance in the title role brush aside complaints."
  },
  {
    "Rank": 54,
    "MovieTitle": "Set It Up",
    "Year": 2018,
    "Score": 92,
    "Director": "Claire Scanlon",
    "Cast": "Zoey Deutch, Glen Powell, Lucy Liu, Taye Diggs",
    "CriticsConsensus": "Set It Up follows the long-established outlines of the rom-com template -- and in the process, proves there's still substantial pleasure to be wrought from familiar formulas."
  },
  {
    "Rank": 55,
    "MovieTitle": "Parenthood",
    "Year": 1989,
    "Score": 92,
    "Director": "Ron Howard",
    "Cast": "Steve Martin, Mary Steenburgen, Dianne Wiest, Jason Robards",
    "CriticsConsensus": "Bolstered by a delightful cast, Parenthood is a funny and thoughtfully crafted look at the best and worst moments of family life that resonates broadly."
  },
  {
    "Rank": 56,
    "MovieTitle": "Mindhorn",
    "Year": 2016,
    "Score": 92,
    "Director": "Sean Foley",
    "Cast": "Julian Barratt, Essie Davis, Andrea Riseborough, Harriet Walter",
    "CriticsConsensus": "Led by a committed performance from Julian Barratt, Mindhorn offers audiences a laugh-out-loud comedy whose sublime silliness is enhanced by its more thoughtful moments."
  },
  {
    "Rank": 57,
    "MovieTitle": 1922,
    "Year": 2017,
    "Score": 92,
    "Director": "Zak Hilditch",
    "Cast": "Thomas Jane, Neal McDonough, Molly Parker, Brian d'Arcy James",
    "CriticsConsensus": "Thanks to director Zak Hilditch's patient storytelling and strong work from lead Thomas Jane, 1922 ranks among the more satisfying Stephen King adaptations."
  },
  {
    "Rank": 58,
    "MovieTitle": "Uncorked",
    "Year": 2020,
    "Score": 92,
    "Director": "Prentice Penny",
    "Cast": "Mamoudou Athie, Courtney B. Vance, Niecy Nash, Sasha Compère",
    "CriticsConsensus": "Like a good wine, once you let Uncorked breathe, its heartfelt tenderness will yield a sweet time."
  },
  {
    "Rank": 59,
    "MovieTitle": "La La Land",
    "Year": 2016,
    "Score": 91,
    "Director": "Damien Chazelle",
    "Cast": "Ryan Gosling, Emma Stone, John Legend, Rosemarie DeWitt",
    "CriticsConsensus": "La La Land breathes new life into a bygone genre with thrillingly assured direction, powerful performances, and an irresistible excess of heart."
  },
  {
    "Rank": 60,
    "MovieTitle": "Phantom Thread",
    "Year": 2017,
    "Score": 91,
    "Director": "Paul Thomas Anderson",
    "Cast": "Daniel Day-Lewis, Vicky Krieps, Lesley Manville, Camilla Rutherford",
    "CriticsConsensus": "Phantom Thread's finely woven narrative is filled out nicely by humor, intoxicating romantic tension, and yet another impressively committed performance from Daniel Day-Lewis."
  },
  {
    "Rank": 61,
    "MovieTitle": "The Nice Guys",
    "Year": 2016,
    "Score": 91,
    "Director": "Shane Black",
    "Cast": "Russell Crowe, Ryan Gosling, Angourie Rice, Matt Bomer",
    "CriticsConsensus": "The Nice Guys hearkens back to the buddy comedies of a bygone era while adding something extra courtesy of a knowing script and the irresistible chemistry of its leads."
  },
  {
    "Rank": 62,
    "MovieTitle": "Zero Dark Thirty",
    "Year": 2012,
    "Score": 91,
    "Director": "Kathryn Bigelow",
    "Cast": "Jessica Chastain, Jason Clarke, Joel Edgerton, Jennifer Ehle",
    "CriticsConsensus": "Gripping, suspenseful, and brilliantly crafted, Zero Dark Thirty dramatizes the hunt for Osama bin Laden with intelligence and an eye for detail."
  },
  {
    "Rank": 63,
    "MovieTitle": "The Lord of the Rings: The Fellowship of the Ring",
    "Year": 2001,
    "Score": 91,
    "Director": "Peter Jackson",
    "Cast": "Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen",
    "CriticsConsensus": "Full of eye-popping special effects, and featuring a pitch-perfect cast, The Lord of the Rings: The Fellowship of the Ring brings J.R.R. Tolkien's classic to vivid life."
  },
  {
    "Rank": 64,
    "MovieTitle": "Philomena",
    "Year": 2013,
    "Score": 91,
    "Director": "Stephen Frears",
    "Cast": "Judi Dench, Steve Coogan, Michelle Fairley, Barbara Jefford",
    "CriticsConsensus": "Based on a powerful true story and led by note-perfect performances from Judi Dench and Steve Coogan, Philomena offers a profoundly affecting drama for adult filmgoers of all ages."
  },
  {
    "Rank": 65,
    "MovieTitle": "The White Tiger",
    "Year": 2021,
    "Score": 91,
    "Director": "Ramin Bahrani",
    "Cast": "Adarsh Gourav, Rajkummar Rao, Priyanka Chopra Jonas, Vedant Sinha",
    "CriticsConsensus": "Well-acted and beautifully made, The White Tiger distills the strengths of its source material into a grimly compelling drama."
  },
  {
    "Rank": 66,
    "MovieTitle": "Beasts of No Nation",
    "Year": 2015,
    "Score": 91,
    "Director": "Cary Joji Fukunaga",
    "Cast": "Idris Elba, Abraham Attah, Opeyemi Fagbohungbe, Kurt Egyiawan",
    "CriticsConsensus": "Beasts of No Nation finds writer-director Cary Fukunaga working with a talented cast to offer a sobering, uncompromising, yet still somehow hopeful picture of war's human cost."
  },
  {
    "Rank": 67,
    "MovieTitle": "High Flying Bird",
    "Year": 2019,
    "Score": 91,
    "Director": "Steven Soderbergh",
    "Cast": "André Holland, Zazie Beetz, Bill Duke, Sonja Sohn",
    "CriticsConsensus": "High Flying Bird takes a thoughtful and engrossing look at professional sports that sees Steven Soderbergh continuing to test the limits of new filmmaking technology."
  },
  {
    "Rank": 68,
    "MovieTitle": "Apollo 10 1/2: A Space Age Childhood",
    "Year": 2022,
    "Score": 91,
    "Director": "Richard Linklater",
    "Cast": "Jack Black, Bill Wise, Lee Eddy, Milo Coy",
    "CriticsConsensus": "The sweetly nostalgic Apollo 10 1/2: A Space Age Childhood finds Richard Linklater reusing visual and thematic ingredients in a deeply personal, freshly inspired way."
  },
  {
    "Rank": 69,
    "MovieTitle": "Happy as Lazzaro",
    "Year": 2018,
    "Score": 91,
    "Director": "Alice Rohrwacher",
    "Cast": "Adriano Tardiolo, Alba Rohrwacher, Agnese Graziani, Tommaso Ragno",
    "CriticsConsensus": "Happy as Lazzaro uses a friendship's ups and downs as a satisfyingly expansive canvas for a picture rich with thematic and cinematic depth."
  },
  {
    "Rank": 70,
    "MovieTitle": "Full Metal Jacket",
    "Year": 1987,
    "Score": 91,
    "Director": "Stanley Kubrick",
    "Cast": "Matthew Modine, Adam Baldwin, Vincent D'Onofrio, R. Lee Ermey",
    "CriticsConsensus": "Intense, tightly constructed, and darkly comic at times, Stanley Kubrick's Full Metal Jacket may not boast the most original of themes, but it is exceedingly effective at communicating them."
  },
  {
    "Rank": 71,
    "MovieTitle": "Gerald's Game",
    "Year": 2017,
    "Score": 91,
    "Director": "Mike Flanagan",
    "Cast": "Carla Gugino, Bruce Greenwood, Henry Thomas, Carel Struycken",
    "CriticsConsensus": "Carla Gugino carries Gerald's Game's small-scale suspense with a career-defining performance."
  },
  {
    "Rank": 72,
    "MovieTitle": "When Harry Met Sally...",
    "Year": 1989,
    "Score": 91,
    "Director": "Rob Reiner",
    "Cast": "Billy Crystal, Meg Ryan, Carrie Fisher, Bruno Kirby",
    "CriticsConsensus": "Rob Reiner's touching, funny film set a new standard for romantic comedies, and he was ably abetted by the sharp interplay between Billy Crystal and Meg Ryan."
  },
  {
    "Rank": 73,
    "MovieTitle": "The Willoughbys",
    "Year": 2020,
    "Score": 91,
    "Director": "Kris Pearn",
    "Cast": "Will Forte, Maya Rudolph, Alessia Cara, Terry Crews",
    "CriticsConsensus": "An appealing animated adventure whose silliness is anchored in genuine emotion, The Willoughbys offers fanciful fun the entire family can enjoy."
  },
  {
    "Rank": 74,
    "MovieTitle": "National Lampoon's Animal House",
    "Year": 1978,
    "Score": 91,
    "Director": "John Landis",
    "Cast": "John Belushi, Kevin Bacon, Donald Sutherland, Karen Allen",
    "CriticsConsensus": "The talents of director John Landis and Saturday Night Live's irrepressible John Belushi conspired to create a rambunctious, subversive college comedy that continues to resonate."
  },
  {
    "Rank": 75,
    "MovieTitle": "Up in the Air",
    "Year": 2009,
    "Score": 90,
    "Director": "Jason Reitman",
    "Cast": "George Clooney, Vera Farmiga, Anna Kendrick, Jason Bateman",
    "CriticsConsensus": "Led by charismatic performances by its three leads, director Jason Reitman delivers a smart blend of humor and emotion with just enough edge for mainstream audiences."
  },
  {
    "Rank": 76,
    "MovieTitle": "The Imitation Game",
    "Year": 2014,
    "Score": 90,
    "Director": "Morten Tyldum",
    "Cast": "Benedict Cumberbatch, Keira Knightley, Matthew Goode, Rory Kinnear",
    "CriticsConsensus": "With an outstanding starring performance from Benedict Cumberbatch illuminating its fact-based story, The Imitation Game serves as an eminently well-made entry in the \"prestige biopic\" genre."
  },
  {
    "Rank": 77,
    "MovieTitle": "Minority Report",
    "Year": 2002,
    "Score": 90,
    "Director": "Steven Spielberg",
    "Cast": "Tom Cruise, Colin Farrell, Samantha Morton, Max von Sydow",
    "CriticsConsensus": "Thought-provoking and visceral, Steven Spielberg successfully combines high concept ideas and high octane action in this fast and febrile sci-fi thriller."
  },
  {
    "Rank": 78,
    "MovieTitle": "Spider-Man",
    "Year": 2002,
    "Score": 90,
    "Director": "Sam Raimi",
    "Cast": "Tobey Maguire, Willem Dafoe, Kirsten Dunst, James Franco",
    "CriticsConsensus": "Not only does Spider-Man provide a good dose of web-swinging fun, it also has a heart, thanks to the combined charms of director Sam Raimi and star Tobey Maguire."
  },
  {
    "Rank": 79,
    "MovieTitle": "The Two Popes",
    "Year": 2019,
    "Score": 90,
    "Director": "Fernando Meirelles",
    "Cast": "Jonathan Pryce, Anthony Hopkins, Juan Minujín, Sidney Cole",
    "CriticsConsensus": "Led by outstanding performances from its well-matched leads, The Two Popes draws absorbing drama from a pivotal moment in modern organized religion."
  },
  {
    "Rank": 80,
    "MovieTitle": "The Kindergarten Teacher",
    "Year": 2018,
    "Score": 90,
    "Director": "Sara Colangelo",
    "Cast": "Maggie Gyllenhaal, Gael García Bernal, Michael Chernus, Anna Baryshnikov",
    "CriticsConsensus": "Elevated by a bravura performance from Maggie Gyllenhaal, The Kindergarten Teacher is one American remake that retains its impact the second time around."
  },
  {
    "Rank": 81,
    "MovieTitle": "Reservoir Dogs",
    "Year": 1992,
    "Score": 90,
    "Director": "Quentin Tarantino",
    "Cast": "Harvey Keitel, Tim Roth, Michael Madsen, Chris Penn",
    "CriticsConsensus": "Thrumming with intelligence and energy, Reservoir Dogs opens Quentin Tarantino's filmmaking career with hard-hitting style."
  },
  {
    "Rank": 82,
    "MovieTitle": "On Body and Soul",
    "Year": 2017,
    "Score": 90,
    "Director": "Ildikó Enyedi",
    "Cast": "Géza Morcsányi, Alexandra Borbély, Zoltán Schneider, Ervin Nagy",
    "CriticsConsensus": "Tender performances and a strong sense of style combine to create an eccentric, dreamy portrait of love and loneliness in On Body and Soul."
  },
  {
    "Rank": 83,
    "MovieTitle": "The Bridges of Madison County",
    "Year": 1995,
    "Score": 90,
    "Director": "Clint Eastwood",
    "Cast": "Clint Eastwood, Meryl Streep, Annie Corley, Victor Slezak",
    "CriticsConsensus": "Sentimental, slow, schmaltzy, and very satisfying, The Bridges of Madison County finds Clint Eastwood adapting a bestseller with heft, wit, and grace."
  },
  {
    "Rank": 84,
    "MovieTitle": "The Trial of the Chicago 7",
    "Year": 2020,
    "Score": 89,
    "Director": "Aaron Sorkin",
    "Cast": "Eddie Redmayne, Alex Sharp, Sacha Baron Cohen, Jeremy Strong",
    "CriticsConsensus": "An actors' showcase enlivened by its topical fact-based story, The Trial of the Chicago 7 plays squarely -- and compellingly -- to Aaron Sorkin's strengths."
  },
  {
    "Rank": 85,
    "MovieTitle": "Zombieland",
    "Year": 2009,
    "Score": 89,
    "Director": "Ruben Fleischer",
    "Cast": "Woody Harrelson, Jesse Eisenberg, Emma Stone, Abigail Breslin",
    "CriticsConsensus": "Wickedly funny and featuring plenty of gore, Zombieland is proof that the zombie subgenre is far from dead."
  },
  {
    "Rank": 86,
    "MovieTitle": "The Ballad of Buster Scruggs",
    "Year": 2018,
    "Score": 89,
    "Director": "Joel Coen",
    "Cast": "Tim Blake Nelson, Willie Watson, David Krumholtz, James Franco",
    "CriticsConsensus": "The Ballad of Buster Scruggs avoids anthology pitfalls with a consistent collection tied together by the Coen brothers' signature blend of dark drama and black humor."
  },
  {
    "Rank": 87,
    "MovieTitle": "All Quiet on the Western Front",
    "Year": 2022,
    "Score": 90,
    "Director": "Edward Berger",
    "Cast": "Felix Kammerer, Albrecht Schuch, Aaron Hilmer, Moritz Klaus",
    "CriticsConsensus": "Both timely and timeless, All Quiet on the Western Front retains the power of its classic source material by focusing on the futility of war."
  },
  {
    "Rank": 88,
    "MovieTitle": "Always Be My Maybe",
    "Year": 2019,
    "Score": 89,
    "Director": "Nahnatchka Khan",
    "Cast": "Ali Wong, Randall Park, Keanu Reeves, Michelle Buteau",
    "CriticsConsensus": "Carried by the infectious charms of Ali Wong and Randall Park, Always Be My Maybe takes familiar rom-com beats and cleverly layers in smart social commentary to find its own sweet groove."
  },
  {
    "Rank": 89,
    "MovieTitle": "I Am Mother",
    "Year": 2019,
    "Score": 89,
    "Director": "Grant Sputore",
    "Cast": "Hilary Swank, Clara Rugaard, Rose Byrne, Tahlia Sturzaker",
    "CriticsConsensus": "Suspenseful, well-acted, and intelligent, I Am Mother is an ambitious sci-fi story that largely achieves its impressive aims."
  },
  {
    "Rank": 90,
    "MovieTitle": "I Don't Feel at Home in This World Anymore",
    "Year": 2017,
    "Score": 89,
    "Director": "Macon Blair",
    "Cast": "Melanie Lynskey, Elijah Wood, David Yow, Jane Levy",
    "CriticsConsensus": "I don't feel at home in this world anymore. transcends its unwieldy title to offer timely, intoxicatingly dark observations on gender dynamics and social norms in modern America."
  },
  {
    "Rank": 91,
    "MovieTitle": "Paddleton",
    "Year": 2019,
    "Score": 89,
    "Director": "Alexandre Lehmann",
    "Cast": "Mark Duplass, Ray Romano, Marguerite Moreau, Christine Woods",
    "CriticsConsensus": "It takes its time coming together, but the quietly effective Paddleton pulls off a tricky tonal balancing act, thanks largely to the strengths of its well-chosen leads."
  },
  {
    "Rank": 92,
    "MovieTitle": "Rango",
    "Year": 2011,
    "Score": 88,
    "Director": "Gore Verbinski",
    "Cast": "Johnny Depp, Isla Fisher, Abigail Breslin, Ned Beatty",
    "CriticsConsensus": "Rango is a smart, giddily creative burst of beautifully animated entertainment, and Johnny Depp gives a colorful vocal performance as a household pet in an unfamiliar world."
  },
  {
    "Rank": 93,
    "MovieTitle": "The Bad Guys",
    "Year": 2022,
    "Score": 88,
    "Director": "Pierre Perifel",
    "Cast": "Sam Rockwell, Zazie Beetz, Marc Maron, Awkwafina",
    "CriticsConsensus": "Fast-paced, funny, and full of colorful visual appeal, The Bad Guys is good news for audiences seeking options the whole family can enjoy."
  },
  {
    "Rank": 94,
    "MovieTitle": "Dope",
    "Year": 2015,
    "Score": 88,
    "Director": "Rick Famuyiwa",
    "Cast": "Shameik Moore, Tony Revolori, Kiersey Clemons, Kimberly Elise",
    "CriticsConsensus": "Featuring a starmaking performance from Shameik Moore and a refreshingly original point of view from writer-director Rick Famuyiwa, Dope is smart, insightful entertainment."
  },
  {
    "Rank": 95,
    "MovieTitle": "Oxygen",
    "Year": 2021,
    "Score": 88,
    "Director": "Alexandre Aja",
    "Cast": "Mélanie Laurent, Mathieu Amalric, Malik Zidi, Marc Saez",
    "CriticsConsensus": "Oxygen gets the white-knuckle maximum out of its claustrophobic setting, with director Alexandre Aja and star Mélanie Laurent making this a must-watch thriller for sci-fi fans."
  },
  {
    "Rank": 96,
    "MovieTitle": "Fear Street Part Three: 1666",
    "Year": 2021,
    "Score": 88,
    "Director": "Leigh Janiak",
    "Cast": "Kiana Madeira, Ashley Zukerman, Gillian Jacobs, Olivia Welch",
    "CriticsConsensus": "Fear Street Part Three: 1666 sends the slasher series back in time for a trilogy-concluding installment that caps things off on a screaming high note."
  },
  {
    "Rank": 97,
    "MovieTitle": "Donnie Brasco",
    "Year": 1997,
    "Score": 88,
    "Director": "Mike Newell",
    "Cast": "Al Pacino, Johnny Depp, Michael Madsen, Bruno Kirby",
    "CriticsConsensus": "A stark, nuanced portrait of life in organized crime, bolstered by strong performances from Al Pacino and Johnny Depp."
  },
  {
    "Rank": 98,
    "MovieTitle": "Inception",
    "Year": 2010,
    "Score": 87,
    "Director": "Christopher Nolan",
    "Cast": "Leonardo DiCaprio, Joseph Gordon-Levitt, Elliot Page, Tom Hardy",
    "CriticsConsensus": "Smart, innovative, and thrilling, Inception is that rare summer blockbuster that succeeds viscerally as well as intellectually."
  },
  {
    "Rank": 99,
    "MovieTitle": "American Beauty",
    "Year": 1999,
    "Score": 87,
    "Director": "Sam Mendes",
    "Cast": "Kevin Spacey, Annette Bening, Thora Birch, Wes Bentley",
    "CriticsConsensus": "Flawlessly cast and brimming with dark, acid wit, American Beauty is a smart, provocative high point of late '90s mainstream Hollywood film."
  },
  {
    "Rank": 100,
    "MovieTitle": "Kung Fu Panda",
    "Year": 2008,
    "Score": 87,
    "Director": "John Stevenson",
    "Cast": "Jack Black, Angelina Jolie, Jackie Chan, David Cross",
    "CriticsConsensus": "Kung Fu Panda has a familiar message, but the pleasing mix of humor, swift martial arts action, and colorful animation makes for winning Summer entertainment."
  }
]